
[
  {
    "id": 1,
    "title": "What is a MongoDB Replica Set? A Beginner-Friendly Guide with Docker Compose Demo",
    "date": "2025-04-19",
    "summary": "A beginner-friendly guide to understanding MongoDB replica sets. Learn how to achieve high availability and fault tolerance with primary-secondary node setup, automatic failover, and a hands-on Docker Compose demo.",
    "readTime": "6 min read",
    "url": "https://logak.hashnode.dev/create-a-scalable-web-app-with-docker-compose-in-under-5-minutes"
  },
  {
    "id": 2,
    "title": "Create a Scalable Web App with Docker Compose in Under 5 Minutes",
    "date": "2025-04-18",
    "summary": "A quick-start guide to building and scaling a web application using Docker Compose. Learn how to containerize frontend, backend, and database services, and orchestrate them for rapid development and deployment—all in under 5 minutes.",
    "readTime": "3 min read",
    "url": "https://logak.hashnode.dev/create-a-scalable-web-app-with-docker-compose-in-under-5-minutes"
  },
  {
    "id": 3,
    "title": "MLOps: Bridging the Gap Between Data Science and Production",
    "date": "2023-12-22",
    "summary": "How to build effective MLOps pipelines that enable seamless model deployment, monitoring, and management in production environments. Includes real-world case studies and architecture patterns.",
    "readTime": "15 min read",
    "url": "https://your-blog.com/mlops-data-science-production"
  },
  {
    "id": 4,
    "title": "Stream Processing Patterns with Apache Kafka",
    "date": "2023-12-15",
    "summary": "Essential patterns for building robust stream processing applications. Learn about windowing, joins, exactly-once processing, and fault tolerance strategies for high-throughput systems.",
    "readTime": "10 min read",
    "url": "https://your-blog.com/stream-processing-apache-kafka"
  },
  {
    "id": 5,
    "title": "Cost Optimization in Cloud Data Engineering",
    "date": "2023-12-01",
    "summary": "Practical strategies for optimizing costs in cloud-based data engineering projects without compromising performance or reliability. Real examples of 40%+ cost reductions.",
    "readTime": "7 min read",
    "url": "https://your-blog.com/cost-optimization-cloud-data-engineering"
  },
  {
    "id": 6,
    "title": "The Future of Data Mesh Architecture",
    "date": "2023-11-18",
    "summary": "Exploring the principles and implementation strategies of data mesh architecture for large-scale, decentralized data systems. Lessons learned from enterprise implementations.",
    "readTime": "13 min read",
    "url": "https://your-blog.com/future-data-mesh-architecture"
  },
  {
    "id": 7,
    "title": "Real-time Analytics at Scale: Lessons from the Trenches",
    "date": "2023-11-05",
    "summary": "Building real-time analytics systems that process millions of events per minute. Architecture decisions, technology choices, and operational challenges overcome in production environments.",
    "readTime": "11 min read",
    "url": "https://your-blog.com/realtime-analytics-scale"
  },
  {
    "id": 8,
    "title": "Data Lineage: Making Your Data Trustworthy",
    "date": "2023-10-20",
    "summary": "Implementing comprehensive data lineage tracking across complex data ecosystems. Tools, techniques, and best practices for maintaining data trust and regulatory compliance.",
    "readTime": "9 min read",
    "url": "https://your-blog.com/data-lineage-trustworthy"
  }
]
